# Q 1

In [1]:
import sqlite3
con=sqlite3.connect('temp_db')
cur=con.cursor()

# Q 2

In [2]:
cur.execute('create table if not exists emp(empno INTEGER,ename TEXT,salary INTEGER,deptno INTEGER)')

# Q 3

In [3]:
def insert(empno,ename,salary,deptno):
    cur.execute('insert into emp values(?,?,?,?)',(empno,ename,salary,deptno))
    con.commit()

In [4]:
insert(101,'Rose Daniels',15000,10)
insert(102,'Mia Madison',20000,20)
insert(103,'Ashley Stonegal',25000,30)
insert(104,'Andrew Olesten',25000,10)
insert(105,'Danny MILLS',30000,50)

# Q 4

In [5]:
def view():
    con=sqlite3.connect('temp_db')
    cur=con.cursor()
    cur.execute('select * from emp')
    rows=cur.fetchall()
    con.close()
    return rows

In [6]:
view()

[(101, 'Rose Daniels', 15000, 10),
 (102, 'Mia Madison', 20000, 20),
 (103, 'Ashley Stonegal', 25000, 30),
 (104, 'Andrew Olesten', 25000, 10),
 (105, 'Danny MILLS', 30000, 50)]

# Q 5

In [7]:
def view1():
    con=sqlite3.connect('temp_db')
    cur=con.cursor()
    cur.execute('select * from emp where salary>15000 and deptno==10')
    rows=cur.fetchall()
    con.close()
    return rows

In [8]:
view1()

[(104, 'Andrew Olesten', 25000, 10)]

# Q 6

In [9]:
def view2():
    con=sqlite3.connect('temp_db')
    cur=con.cursor()
    cur.execute('select * from emp where salary>20000 and salary<25000 and deptno!=10')
    rows=cur.fetchall()
    con.close()
    return rows

In [10]:
view2()

[]

# Q 7

In [11]:
def viewM():
    con=sqlite3.connect('temp_db')
    cur=con.cursor()
    cur.execute('select * from emp where ename LIKE "M%" ')
    rows=cur.fetchall()
    con.close()
    return rows

In [12]:
viewM()

[(102, 'Mia Madison', 20000, 20)]

# Q 8

In [13]:
import sqlite3
def delete():
    con=sqlite3.connect('temp_db')
    cur=con.cursor()
    cur.execute('delete from emp where deptno==30')
    rows=cur.fetchall()
    con.commit()
    con.close()
    return rows

In [14]:
delete()

[]

In [15]:
view()

[(101, 'Rose Daniels', 15000, 10),
 (102, 'Mia Madison', 20000, 20),
 (104, 'Andrew Olesten', 25000, 10),
 (105, 'Danny MILLS', 30000, 50)]

# Q 9

In [16]:
def update(emp):
    con=sqlite3.connect("temp_db")
    cur=con.cursor()
    cur.execute("update emp set salary=salary+(salary*10/100) where empno=?",(emp,))
    con.commit()
    con.close()

In [17]:
update(101)

In [18]:
view()

[(101, 'Rose Daniels', 16500, 10),
 (102, 'Mia Madison', 20000, 20),
 (104, 'Andrew Olesten', 25000, 10),
 (105, 'Danny MILLS', 30000, 50)]

# Q 10

In [19]:
def drop():
    con = sqlite3.connect('temp_db')
    cur = con.cursor()
    cur.execute("DROP TABLE emp")
    con.commit()
    con.close

In [20]:
drop()

In [21]:
view()

OperationalError: no such table: emp